<a href="https://colab.research.google.com/github/muhendis/dev-pykasif/blob/master/DataCleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Overview

## Library

In [1]:
cd /content/drive/MyDrive/dikey eksen/code

/content/drive/MyDrive/dikey eksen/code

In [2]:
from assistant.datacleaning import DataCleaning
import numpy as np
import pandas as pd

## Veri seti oluşturma

In [3]:

# Eğitim veri seti oluşturma
v_1 = np.array ([0,2,4,4,8,10,12,14,16,180])
v_2 = np.array([ 0,4,8, 8, 16, 20, 24, 28, 32, 370])
v_3 = np.array ([np.NaN,np.NaN,20,20,24,np.NaN,np.NaN,np.NaN,np.NaN,14])
v_4 = np.array ([10,18,6,6,18,1,8,7,np.NaN,np.NaN])

df_train = pd.DataFrame({"v_1":v_1,"v_2":v_2,"v_3":v_3,"v_4":v_4})

# Test veri seti oluşturma

v_1 = np.array ([0,2,8,10])
v_2 = np.array([ 0,4, 16, 20])
v_3 = np.array ([np.NaN,np.NaN,np.NaN,20])
v_4 = np.array ([10,1,np.NaN,np.NaN])

df_test = pd.DataFrame({"v_1":v_1,"v_2":v_2,"v_3":v_3,"v_4":v_4})

dc=DataCleaning(df_train,df_test)

In [4]:
dc.df_train

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN  18.0
2    4    8  20.0   6.0
3    4    8  20.0   6.0
4    8   16  24.0  18.0
5   10   20   NaN   1.0
6   12   24   NaN   8.0
7   14   28   NaN   7.0
8   16   32   NaN   NaN
9  180  370  14.0   NaN

In [5]:
dc.df_test

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN   1.0
2    8   16   NaN   NaN
3   10   20  20.0   NaN

# Yinelenen gözlemler

In [6]:
dc.show_duplicate_observations()

{'df_test': Empty DataFrame
 Columns: [v_1, v_2, v_3, v_4]
 Index: [], 'df_train':    v_1  v_2   v_3  v_4
 3    4    8  20.0  6.0}

In [7]:
dc.remove_duplicate_observations()

In [8]:
dc.show_duplicate_observations()

{'df_test': Empty DataFrame
 Columns: [v_1, v_2, v_3, v_4]
 Index: [], 'df_train': Empty DataFrame
 Columns: [v_1, v_2, v_3, v_4]
 Index: []}

# Kayıp değer

In [9]:
dc.df_train

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN  18.0
2    4    8  20.0   6.0
4    8   16  24.0  18.0
5   10   20   NaN   1.0
6   12   24   NaN   8.0
7   14   28   NaN   7.0
8   16   32   NaN   NaN
9  180  370  14.0   NaN

In [10]:
dc.df_test

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN   1.0
2    8   16   NaN   NaN
3   10   20  20.0   NaN

In [11]:
dc.show_missing_values()

{'df_test': v_1    0
 v_2    0
 v_3    3
 v_4    2
 dtype: int64, 'df_train': v_1    0
 v_2    0
 v_3    6
 v_4    2
 dtype: int64}

In [12]:
def reset_data():
  dc=DataCleaning(df_train,df_test)
  return dc

# Kayıp verilere çözüm bulma

## 1. Sileme tedavisi uygulama

In [13]:
dc = reset_data()
dc.missing_values_treatment(feature="v_3",strategy="delete")

In [14]:
dc.df_train

   v_1  v_2   v_4
0    0    0  10.0
1    2    4  18.0
2    4    8   6.0
3    4    8   6.0
4    8   16  18.0
5   10   20   1.0
6   12   24   8.0
7   14   28   7.0
8   16   32   NaN
9  180  370   NaN

In [15]:
dc.df_test

   v_1  v_2   v_4
0    0    0  10.0
1    2    4   1.0
2    8   16   NaN
3   10   20   NaN

## 2.Ortalama tedavisi uygulama

In [16]:
# veriyi sıfırlayalım
dc = reset_data()
dc.missing_values_treatment(feature="v_4",strategy="mean")

Mean :  9.25

In [17]:
dc.df_train

   v_1  v_2   v_3    v_4
0    0    0   NaN  10.00
1    2    4   NaN  18.00
2    4    8  20.0   6.00
3    4    8  20.0   6.00
4    8   16  24.0  18.00
5   10   20   NaN   1.00
6   12   24   NaN   8.00
7   14   28   NaN   7.00
8   16   32   NaN   9.25
9  180  370  14.0   9.25

In [18]:
dc.df_test

   v_1  v_2   v_3    v_4
0    0    0   NaN  10.00
1    2    4   NaN   1.00
2    8   16   NaN   9.25
3   10   20  20.0   9.25

## 3.Mod tedavisi uygulama

In [19]:
# veriyi sıfırlayalım
dc = reset_data()
dc.missing_values_treatment(feature="v_4",strategy="mode")

Mode :  6.0

In [20]:
dc.df_train

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN  18.0
2    4    8  20.0   6.0
3    4    8  20.0   6.0
4    8   16  24.0  18.0
5   10   20   NaN   1.0
6   12   24   NaN   8.0
7   14   28   NaN   7.0
8   16   32   NaN   6.0
9  180  370  14.0   6.0

In [21]:
dc.df_test

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN   1.0
2    8   16   NaN   6.0
3   10   20  20.0   6.0

## 4.Medyan tedavisi uygulama

In [22]:
# veriyi sıfırlayalım
dc = reset_data()
dc.missing_values_treatment(feature="v_4",strategy="median")

Median :  7.5

In [23]:
dc.df_train

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN  18.0
2    4    8  20.0   6.0
3    4    8  20.0   6.0
4    8   16  24.0  18.0
5   10   20   NaN   1.0
6   12   24   NaN   8.0
7   14   28   NaN   7.0
8   16   32   NaN   7.5
9  180  370  14.0   7.5

In [24]:
dc.df_test

   v_1  v_2   v_3   v_4
0    0    0   NaN  10.0
1    2    4   NaN   1.0
2    8   16   NaN   7.5
3   10   20  20.0   7.5

## 5.Eksik verilere KNN uygulama

In [25]:
# veriyi sıfırlayalım
dc = reset_data()
dc.missing_values_treatment(strategy="KNN")

In [26]:
dc.df_train

     v_1    v_2        v_3        v_4
0    0.0    0.0  21.333333  10.000000
1    2.0    4.0  21.333333  18.000000
2    4.0    8.0  20.000000   6.000000
3    4.0    8.0  20.000000   6.000000
4    8.0   16.0  24.000000  18.000000
5   10.0   20.0  21.333333   1.000000
6   12.0   24.0  21.333333   8.000000
7   14.0   28.0  21.333333   7.000000
8   16.0   32.0  21.333333   5.333333
9  180.0  370.0  14.000000  10.000000

In [27]:
dc.df_test

    v_1   v_2        v_3        v_4
0   0.0   0.0  21.333333  10.000000
1   2.0   4.0  21.333333   1.000000
2   8.0  16.0  21.333333   8.333333
3  10.0  20.0  20.000000   9.000000

# B. Aykırı Değer Tespiti

## 1. Çeyrekler arası Aralık (Interquartile Range)

In [28]:
# veriyi sıfırlayalım
dc = reset_data()
result=dc.outlier_detection(feature="v_1",strategy="inter_quartile_range")

Alt sınır :  -10.25
Üst sınır :  27.75

In [29]:
result["df_train"]

   v_1  v_2   v_3  v_4
9  180  370  14.0  NaN

In [30]:
result["df_test"]

Empty DataFrame
Columns: [v_1, v_2, v_3, v_4]
Index: []

## 2. İzolasyon Ormanı (Isolation Forest)

In [34]:
# veriyi sıfırlayalım
dc = reset_data()
result=dc.outlier_detection(feature="v_1",strategy="isolation_forest")

In [35]:
result["df_train"]

   v_1  v_2   v_3  v_4
9  180  370  14.0  NaN

In [36]:
result["df_test"]

Empty DataFrame
Columns: [v_1, v_2, v_3, v_4]
Index: []